app/views/cart/_cart.html.erb

 <%= turbo_frame_tag "cart" do %>
    <% if @cart.orderables.count > 0 %>
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 12]]
SELECT COUNT(*) FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 34]]