app/views/cart/_orderables.html.erb

                    <h1 class="fw-bold mb-0 text-black">Shopping Cart</h1>
                            <% @cart.orderables.each do |orderable| %>
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 34]]