app/views/cart/show.html.erb

<% @cart.orderables.each do |orderable| %>
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 34]]