app/controllers/application_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-07-27 18:37:53.119433"], ["updated_at", "2022-07-27 18:37:53.119433"]]
---
    def initialize_cart
        @cart ||= Cart.find_by(id:session[:cart_id])

        if @cart.nil?
            @cart = Cart.create