app/controllers/cart_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? AND "orderables"."product_id" = ? LIMIT ?  [["cart_id", 8], ["product_id", 1], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 3], ["updated_at", "2022-08-07 03:37:12.488974"], ["id", 6]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
INSERT INTO "orderables" ("product_id", "cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 2], ["cart_id", 8], ["quantity", 4], ["created_at", "2022-08-07 03:20:16.897223"], ["updated_at", "2022-08-07 03:20:16.897223"]]
---
  def add
    @product = Product.find_by(id: params[:id])
    quantity = params[:quantity].to_i
    current_orderable = @cart.orderables.find_by(product_id: @product.id)
    if current_orderable && quantity > 0
      current_orderable.update(quantity: quantity)
    elsif quantity <= 0
      current_orderable.destroy
    else
      @cart.orderables.create(product: @product, quantity: quantity)

DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 4]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def remove
    Orderable.find_by(id: params[:id]).destroy